[["0",{"pageContent":"THE CONTRACT STATES A LINE OF CREDIT THAT IS FDIC INSURED IN THE AMOUNT OF {$250000.00}. WITH THIS ACCOUNT SET UP AND ESTABLISHED IT'S NOT SUBJECT TO A CREDIT REPORT IT STATES IN THE CONTRACT A LINE OF CREDIT WHICH ENTITLES ME TO MORE THAN {$3000.00} AND I DON'T EXCEPT JUST {$3000.00} IT'S NOT ENOUGH.WHATEVER HAPPENED TO THE RIGHTS THAT I'M ENTITLED TO UNDER THE BILL OF EXCHANGE ACT IS THAT NOT IRRELEVANT HERE AT ALL. I'M NEVER LETTING IT GO BECAUSE IF I WAS WHITE I WOULDN'T BE HAVING THIS PROBLEM AT ALL I'M XXXX","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["1",{"pageContent":"On XX/XX/year> I charged {$2600.00} on XXXX XXXX XXXX CitiBank ) credit card. Towards the end of XXXX had to leave XXXX to XXXX. I set up ebill account with CitiBank to make remote payments. In XXXX I received, email stating that my CitiBank ebill set up failed. I tried to contact Citibank to pay the full amount. No way to pay. Upon returning to XXXX I had the followint charges. : XXXX {$26.00} XXXX {$110.00}. XXXX \nXXXX {$140.00} XXXX {$180.00} Upon returning I called the CitiBank to explain the situation. I have had a Macys ' ( Citibank ) account for 40 years. Never missed a payment and have a XXXX XXXX of XXXX for good management of all my credit cards and debt.","metadata":{"loc":{"lines":{"from":1,"to":2}}}}],["2",{"pageContent":"Citibank 's interest rate is XXXX XXXX so I was patronisingly told. I was willing to pay some charges but not exorbitant, usuary interest without consideration of my excellent credit management.. Made payments and they still asked for more interest fees. Last call they stated that they had closed my account without my request. My XXXX XXXX has dropped. No good will for prompt payments in the past and no reduction of interest for good customers. Citibank has extorted me for a charge of {$26.00} with a total final payments of {$280.00} in 5 months. Hate to think what is happening to other consumers. I tried to retrieve my charge information on their website and my account is not valid because they closed my account without my request. The representative stated that they had closed my account due to nonpayment, yet I had paid all the fees thay requested. I fear they wanted to erase me from their system since I stated that I would escalate the overcharged interest.","metadata":{"loc":{"lines":{"from":3,"to":3}}}}]]